---
kind: method
id: M:Autodesk.Revit.DB.FaceArray.ForwardIterator
source: html/02e99234-eafc-332c-6c54-b4a2850c4283.htm
---
# Autodesk.Revit.DB.FaceArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual FaceArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.